num = 12
print(bin(num))
print(oct(num))
print(hex(num))

s = "100011"  # 32
print(int("100011", 2))

n = 50
print(bin(n))  # 110010

d = 13
b = bin(d)
print(type(b))
print(b)
print(b[2:])


"""
 4 3 2 1 0
16 8 4 2 1
 0 1 1 0 0 = > 12

210
000 0
001 1
010 2
011 3
100 4
101 5
110 6
111 7
"""

# X X IV
# 234 = 2*10**2 + 3*10**1 + 4*10**0

"""
7 + 1 = 08
8 + 1 = 09
9 + 2 = 11
9 + 1 = 10

7 + 1 = 10
17(8) + 1(8) = 1_

1
17
 5
--
24

алфавит 02 - 01
алфавит 08 - 01234567
алфавит 10 - 0123456789
алфавит 16 - 0123456789ABCDEF
"""
