s = open('./10724.txt').readline()
al = '0123456789ABCDEFYYYA'

# тоже ещё не дописано

"""

1) заменим все символы 16-ной СС на .
SD..!@KJGLH!@#....YW.RTWY...............

2) заменим все символы НЕ 16-ной СС на .
..EA..........0DDA..E....00006123461AAAC

"""



"""
файл состоит из символов, обозначающих заглавные буквы латинского алфавита и цифры от 0 до 9 включительно. Определите максимальное количество идущих подряд символов, которые могут представлять запись числа в шестнадцатеричной системе счисления.

Числа с незначащими нулями в ответ брать не следует.
12ACEF

"""